Tekla.Structures.Model.BasePoint
The BasePoint class provides base point related functionalities. Base points can be retrieved using
ProjectInfo class.
The following example gets the project information and shows the value of the Name property
in a message dialog:
using Tekla.Structures.Model;
public class Example
{
private void InsertBasePointExample()
{
var BasePoint = new BasePoint(
0, // The id. Use zero when creating new
Guid.Empty, // The guid. Use Guid.Empty when creating new
Guid.Empty, // The initial guid. A metadata field
"Base point name",
"Base point description",
"Base point coordinate system",
1000.0, // North-South value
2000.0, // East-West value
3000.0, // Elevation value
4000.0, // Latitude value
5000.0, // Longitude value
6000.0, // Base points X location in model
7000.0, // Base points Y location in model
8000.0, // Base points Z location in model
(45 * Math.PI / 180), // Angle to north value in radians
false, // Boolean indicating if this base point is project base point
false); // Boolean indicating if this base point is current base point
BasePoint.Insert();
}
private void GetBasePointsExample()
{
var BasePoints = ProjectInfo.GetBasePoints();
}
private void GetBasePointByGuidExample()
{
Guid BasePointGuid = new Guid("TheGuidOfTheBasePoint");
var BasePoints = ProjectInfo.GetBasePointByGuid(BasePointGuid);
}
private void GetBasePointByNameExample()
{
Guid BasePointGuid = new Guid("TheNameOfTheBasePoint");
var BasePoints = ProjectInfo.GetBasePointByGuid(BasePointGuid);
}
}

Tekla.Structures.Model.BasePoint.round(System.Double)
Cast double to integer by Rounding away from zero.
value: rounding double.
Returns: Rounded integer.

Tekla.Structures.Model.BasePoint.DegreesMinutesSeconds(System.Double,System.Int32)
Converts angle value to compound plane angle: degree, minute and second.
angle:  Lat or lon angle.
range:  Lat or lon range. ONE OF [90 || 180]
Returns: Tuple(bool, int, int, int), where bool is validity, item0 = degree, item1 = minute, item2 = second

Tekla.Structures.Model.BasePoint.#ctor(System.String)
Initializes a new instance of the Tekla.Structures.Model.BasePoint class.
name: The name.

Tekla.Structures.Model.BasePoint.#ctor(System.Int32,System.Guid,System.String,System.String,System.String,System.String,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Boolean,System.Boolean)
Initializes a new instance of the Tekla.Structures.Model.BasePoint class.
id: The id.
guid: The guid.
initialGuid: The initial guid.
name: The name.
description: The description.
coordinateSystem: The coordinate system.
northSouth: The north-south.
eastWest: The east-west.
elevation: The elevation.
latitude: The latitude.
longitude: The longitude.
locationInModelX: The location in model x.
locationInModelY: The location in model y.
locationInModelZ: The location in model z.
angleToNorth: The angle to north in radians.
isProjectBasePoint: Boolean indicating if this base point is the project base point.
isCurrentBasePoint: Boolean indicating if this base point is the current base point.

Tekla.Structures.Model.BasePoint.Id
Gets or sets the id.

Tekla.Structures.Model.BasePoint.Guid
Gets or sets the guid.

Tekla.Structures.Model.BasePoint.InitialGuid
Gets or sets the initial guid. A metadata field to store for example some external
applications base point guid. Not used in itself in any functionality.

Tekla.Structures.Model.BasePoint.Name
Gets or sets the name.

Tekla.Structures.Model.BasePoint.Description
Gets or sets the description.

Tekla.Structures.Model.BasePoint.CoordinateSystem
Gets or sets the coordinate system.

Tekla.Structures.Model.BasePoint.NorthSouth
Gets or sets the north-south.

Tekla.Structures.Model.BasePoint.EastWest
Gets or sets the east-west.

Tekla.Structures.Model.BasePoint.Elevation
Gets or sets the elevation.

Tekla.Structures.Model.BasePoint.Latitude
Gets or sets the latitude.

Tekla.Structures.Model.BasePoint.Longitude
Gets or sets the longitude.

Tekla.Structures.Model.BasePoint.LocationInModelX
Gets or sets the location in model x.

Tekla.Structures.Model.BasePoint.LocationInModelY
Gets or sets the location in model y.

Tekla.Structures.Model.BasePoint.LocationInModelZ
Gets or sets the location in model z.

Tekla.Structures.Model.BasePoint.AngleToNorth
Gets or sets the angle to north in radians.

Tekla.Structures.Model.BasePoint.IsProjectBasePoint
Gets or sets the value indicating if this base point is the project base point.

Tekla.Structures.Model.BasePoint.IsCurrentBasePoint
Gets or sets the value indicating if this base point is the current base point.

Tekla.Structures.Model.BasePoint.IsLocked
Gets or sets the value indicating if this base point is locked.

Tekla.Structures.Model.BasePoint.IsScopedCurrentBasePoint
Gets the value indicating whether this base point is the scoped current base point.
That means, a temporary base point set with the SetAsCurrent method, and changed back when returned token is disposed of.

Tekla.Structures.Model.BasePoint.Insert
Inserts the base point into the model database.
Returns: True on success, otherwise false.

Tekla.Structures.Model.BasePoint.Modify
Modifies the base point in the model database.
Returns: True on success, otherwise false.

Tekla.Structures.Model.BasePoint.Delete
Deletes the base point from the model database.
Returns: True on success, otherwise false.

Tekla.Structures.Model.BasePoint.SetAsCurrent
Sets this base point as current base point point until the token is disposed of.
Can be used for example when retrieving report values according to this base point.
using (basePoint.SetAsCurrent())
{
// Retrieve report values here, for example.
}
Returns:
The disposable token that removes this base points current base point status.

Tekla.Structures.Model.BasePoint.GetCoordinateSystem(Tekla.Structures.Model.BasePoint.CoordinateSystemType)
Gets the coordinate system of the base point.
CoordsysType: Optional: Type of the coordinate system.
Returns: The coordinate system of the base point.

Tekla.Structures.Model.BasePoint.GetCompoundPlaneAngleLatitude
Gets the Latitude as a compound plane angle.
Returns: compound plane angle integers. The first param is true, if the value successfully calculated.

Tekla.Structures.Model.BasePoint.GetCompoundPlaneAngleLongitude
Gets the Longitude as a compound plane angle.
Returns: compound plane angle integers. The first param is true, if the value successfully calculated.

Tekla.Structures.Model.BasePoint.ConvertToBasePoint(Tekla.Structures.Geometry3d.Point)
Converts the given local point to this base point.
point: The point to be converted.
Returns: On success, the converted value. Otherwise the original value.

Tekla.Structures.Model.BasePoint.ConvertFromBasePoint(Tekla.Structures.Geometry3d.Point)
Converts the given point from this base point to local point.
point: The point to be converted.
Returns: On success, the converted value. Otherwise the original value.

Tekla.Structures.Model.BasePoint.ConvertToBasePoint(Tekla.Structures.Model.BasePoint,Tekla.Structures.Geometry3d.Point)
Converts the given local point to given base point.
basePoint: The base point, to which the point is converted to.
point: The point to be converted.
Returns: On success, the converted value. Otherwise the original value.

Tekla.Structures.Model.BasePoint.ConvertFromBasePoint(Tekla.Structures.Model.BasePoint,Tekla.Structures.Geometry3d.Point)
Converts the given base point point to local point.
basePoint: The base point, from which the point is converted from.
point: The point to be converted.
Returns: On success, the converted value. Otherwise the original value.

Tekla.Structures.Model.BasePoint.TransformToGlobal(Tekla.Structures.Geometry3d.Point)
Return point in global coordinate system.
point: Point to transform.
Returns: Return point in global coordinate system.

Tekla.Structures.Model.BasePoint.TransformToLocal(Tekla.Structures.Geometry3d.Point)
Return point in local coordinate system.
point: Point to transform.
Returns: Return point in local coordinate system.

Tekla.Structures.Model.BasePoint.ToStruct
Returns:

Tekla.Structures.Model.BasePoint.FromStruct(Tekla.Structures.ModelInternal.dotBasePointData_t)
Returns:

Tekla.Structures.Model.BasePoint.SetAsCurrentBasePoint(System.Boolean)
Sets this base point as current base point for temporary purposes, such as
getting report values etc.
value: True if current, otherwise false.

Tekla.Structures.Model.BasePoint.Initialize
Initialize.